# Part 2
Loveida Lucero

**Imports**

In [1]:
import pandas as pd
import numpy as np
from sqlalchemy import create_engine
from sqlalchemy_utils import database_exists, create_database
import pymysql
pymysql.install_as_MySQLdb()
from urllib.parse import quote_plus as urlquote

**Verifying string length for model creation**

In [2]:
basics = pd.read_csv('Data/basics.csv')
basics.info()
basics.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 86979 entries, 0 to 86978
Data columns (total 9 columns):
 #   Column          Non-Null Count  Dtype
---  ------          --------------  -----
 0   tconst          86979 non-null  object
 1   titleType       86979 non-null  object
 2   primaryTitle    86979 non-null  object
 3   originalTitle   86979 non-null  object
 4   isAdult         86979 non-null  int64
 5   startYear       86979 non-null  float64
 6   endYear         0 non-null      float64
 7   runtimeMinutes  86979 non-null  int64
 8   genres          86979 non-null  object
dtypes: float64(2), int64(2), object(5)
memory usage: 6.0+ MB

,tconst,titleType,primaryTitle,originalTitle,isAdult,startYear,endYear,runtimeMinutes,genres
0,tt0035423,movie,Kate & Leopold,Kate & Leopold,0,2001.0,NaN,118,"Comedy,Fantasy,Romance"
1,tt0062336,movie,The Tango of the Widower and Its Distorting Mi...,El tango del viudo y su espejo deformante,0,2020.0,NaN,70,Drama
2,tt0069049,movie,The Other Side of the Wind,The Other Side of the Wind,0,2018.0,NaN,122,Drama
3,tt0088751,movie,The Naked Monster,The Naked Monster,0,2005.0,NaN,100,"Comedy,Horror,Sci-Fi"
4,tt0096056,movie,Crime and Punishment,Crime and Punishment,0,2002.0,NaN,126,Drama

In [3]:
# Calculate max string lenghts for object columns
tconst_length = basics['tconst'].fillna('').map(len).max()
tconst_length

10

In [4]:
# Calculate max string lenghts for object columns
title_length = basics['primaryTitle'].fillna('').map(len).max()
title_length

242

In [5]:
# Calculate max string lenghts for object columns
otitle_length = basics['originalTitle'].fillna('').map(len).max()
otitle_length

242

In [6]:
# Calculate max string lenghts for object columns
gconst_length = basics['genres'].fillna('').map(len).max()
gconst_length

29

In [7]:
ratings = pd.read_csv('Data/ratings.csv')
ratings.info()
ratings.head()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

      tconst  averageRating  numVotes
0  tt0035423            6.4     87153
1  tt0062336            6.4       175
2  tt0069049            6.7      7754
3  tt0088751            5.2       336
4  tt0096056            5.6       846

In [8]:
# Calculate max string lenghts for object columns
tconst_length2 = basics['tconst'].fillna('').map(len).max()
tconst_length2

10

## Model ERD

![png](Data/Movies-ERD.png)

In [9]:
import json
with open('/Users/Lovei/.secret/mysql.json')as f:
    login = json.load(f)
    
login.keys()

dict_keys(['username', 'password'])

In [10]:
connection  = f"mysql+pymysql://{login['username']}:{login['password']}@localhost/movies"
engine = create_engine(connection)
conn = engine.connect()

In [11]:
if database_exists(connection):
    print('It exists!')
else:
    create_database(connection)
    print('Database created!')

It exists!

In [12]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

## Ratings

In [13]:
#display ratings csv info
ratings.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 71900 entries, 0 to 71899
Data columns (total 3 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   tconst         71900 non-null  object
 1   averageRating  71900 non-null  float64
 2   numVotes       71900 non-null  int64
dtypes: float64(1), int64(1), object(1)
memory usage: 1.6+ MB

In [14]:
#display ratings db info
q = '''DESCRIBE ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

             Field         Type Null  Key Default Extra
0           tconst  varchar(12)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [15]:
# display rating db columns
describe_r['Field'].values

array(['tconst', 'average_rating', 'number_of_votes'], dtype=object)

In [16]:
# display ratings csv columns
ratings.columns

Index(['tconst', 'averageRating', 'numVotes'], dtype='object')

In [17]:
# rename columns to match db
rename_rating = {'averageRating':'average_rating', 
                'numVotes':'number_of_votes'}
ratings = ratings.rename(rename_rating, axis=1)
ratings.head()

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [18]:
ratings_out = 'Data/ratings.csv'
ratings.to_csv(ratings_out, index=False)

In [19]:
#Load ratings table
#ratings.to_sql("ratings", engine, index=False, if_exists='append') #commented out to avoid intergrity error if ran again

In [20]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

## Genres

In [21]:
q = '''DESCRIBE genres;'''
describe_g = pd.read_sql(q, conn)
describe_g

  Field         Type Null  Key Default Extra
0    id          int   NO  PRI    None
1  name  varchar(30)  YES         None

In [22]:
describe_g['Field'].values

array(['id', 'name'], dtype=object)

## Basics

In [23]:
q = '''DESCRIBE title_basics;'''
describe_tb= pd.read_sql(q, conn)
describe_tb

           Field          Type Null  Key Default Extra
0         tconst   varchar(12)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [24]:
# view database columns
describe_tb['Field'].values

array(['tconst', 'primary_title', 'start_year', 'runtime'], dtype=object)

In [25]:
# view csv columns
basics.columns

Index(['tconst', 'titleType', 'primaryTitle', 'originalTitle', 'isAdult',
       'startYear', 'endYear', 'runtimeMinutes', 'genres'],
      dtype='object')

In [26]:
#remove all columns not in database
basics = basics.drop(columns= ['titleType','originalTitle','isAdult','endYear','genres']) 
basics.columns

Index(['tconst', 'primaryTitle', 'startYear', 'runtimeMinutes'], dtype='object')

In [27]:
#rename columns to match database
rename_basic = {'primaryTitle':'primary_title', 
               'startYear':'start_year', 
               'runtimeMinutes':'runtime'}
basics = basics.rename(rename_basic, axis=1)
basics.head()

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001.0,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020.0,70
2,tt0069049,The Other Side of the Wind,2018.0,122
3,tt0088751,The Naked Monster,2005.0,100
4,tt0096056,Crime and Punishment,2002.0,126

In [28]:
basics.dtypes

tconst            object
primary_title     object
start_year       float64
runtime            int64
dtype: object

In [29]:
# change float to int for start_year
basics['start_year'] = basics['start_year'].astype(int)
basics['start_year'].dtype

dtype('int32')

In [30]:
# Load basics table
#basics.to_sql("title_basics", engine, index=False, if_exists='append')  #commented out to avoid intergrity error if ran again

## Title_basics_has_Genres

In [31]:
q = '''DESCRIBE title_genres;'''
describe_tg = pd.read_sql(q, conn)
describe_tg

                 Field         Type Null Key Default Extra
0  title_basics_tconst  varchar(12)   NO        None
1            genres_id          int   NO        None

## Confirm Database Updates

In [32]:
q = """SHOW TABLES;"""
pd.read_sql(q, conn)

  Tables_in_movies
0           genres
1          ratings
2     title_basics
3     title_genres
4        tmdb_data

In [33]:
q = '''DESCRIBE title_genres;'''
describe_tg = pd.read_sql(q, conn)
describe_tg

                 Field         Type Null Key Default Extra
0  title_basics_tconst  varchar(12)   NO        None
1            genres_id          int   NO        None

In [34]:
q = '''DESCRIBE title_basics;'''
describe_tb = pd.read_sql(q, conn)
describe_tb

           Field          Type Null  Key Default Extra
0         tconst   varchar(12)   NO  PRI    None
1  primary_title  varchar(250)  YES         None
2     start_year           int  YES         None
3        runtime           int  YES         None

In [35]:
q = '''DESCRIBE genres;'''
describe_g = pd.read_sql(q, conn)
describe_g

  Field         Type Null  Key Default Extra
0    id          int   NO  PRI    None
1  name  varchar(30)  YES         None

In [36]:
q = '''DESCRIBE ratings;'''
describe_r = pd.read_sql(q, conn)
describe_r

             Field         Type Null  Key Default Extra
0           tconst  varchar(12)   NO  PRI    None
1   average_rating        float  YES         None
2  number_of_votes          int  YES         None

In [37]:
# Confirm data has been added
q = """
SELECT * FROM ratings
LIMIT 5;
"""
pd.read_sql(q,engine)

      tconst  average_rating  number_of_votes
0  tt0035423             6.4            87153
1  tt0062336             6.4              175
2  tt0069049             6.7             7754
3  tt0088751             5.2              336
4  tt0096056             5.6              846

In [38]:
# Confirm data has been added
q = """
SELECT * FROM genres
LIMIT 5;
"""
pd.read_sql(q,engine)

   id       name
0   0     Action
1   1      Adult
2   2  Adventure
3   3  Animation
4   4  Biography

In [39]:
# Confirm data has been added
q = """
SELECT * FROM title_basics
LIMIT 5;
"""
pd.read_sql(q,engine)

,tconst,primary_title,start_year,runtime
0,tt0035423,Kate & Leopold,2001,118
1,tt0062336,The Tango of the Widower and Its Distorting Mi...,2020,70
2,tt0069049,The Other Side of the Wind,2018,122
3,tt0088751,The Naked Monster,2005,100
4,tt0096056,Crime and Punishment,2002,126

In [40]:
# Confirm data has been added
q = """
SELECT * FROM title_genres
LIMIT 5;
"""
pd.read_sql(q,engine)

  title_basics_tconst  genres_id
0           tt0035423          5
1           tt0035423          9
2           tt0035423         18
3           tt0062336          7
4           tt0069049          7